"""
Ваша первая лабораторная работа будет заключаться в реализации и сравнении алгоритмов поиска подстроки в строке.
Вам нужно будет реализовать следующие алгоритмы, которые мы разбирали на паре:

1) Наивный алгоритм
2) Алгоритм Рабина-Карпа ИЛИ Алгоритм Бойера-Мура-Хорспула
3) Алгоритм Кнутта-Мориса-Пратта ИЛИ Алгоритм Ахо-Карасика

Реализовать нужно на Python (если вам прям вот хочется, вот прям мочи нет, то можно на С++ или Джаве).
Также нужно будет сравнить время работы алгоритма и количество операций сравнения. Не забываем,
что скорость работы нужно сравнивать, используя информацию о множестве прогонов алгоритма на одном наборе данных.
"""


def naive_algorithm():
    pass


def rabin_carp_algorithm():
    pass


def boyer_mur_horspul_algorithm():
    pass


def knutt_moris_pratt_algorithm():
    pass


def aho_karasik_algorithm():
    pass


def main():
    print('hi')


if __name__ == '__main__':
    main()
